// ============================================================================
// Error strings
// ----------------------------------------------------------------------------
"ERROR_BOOTVOL" = "Questo software deve essere installato sul volume di avvio.";
"ERROR_INSTALL" = "Questo volume non risponde ai requisiti per questo aggiornamento.";

"Newer_Package_Installed_message" = "Una versione più recente di Chameleon è già installata";
"Intel_Mac_message" = "Questo software non può essere installato su questo computer .";


// ============================================================================
// Install Type
// ----------------------------------------------------------------------------
"InstallType_title" = "Tipo di installazione";
"InstallType_description" = "Scegli se fare una nuova installazione o aggiornare una già esistente.";

"New_title" = "Nuova Installazione";
"New_description" = "Salva una cartella /Extra, se trovata sulla partizione destinazione. Una nuova verrà creata se scegliete una opzione dall'installer, oltre che al Bootloader.";

"Upgrade_title" = "Aggiornamento";
"Upgrade_description" = "Fonde una cartella /Extra esistente, se trovata sulla partizione destinazione, con qualsiasi opzione scelta nell'installer, oltre al Bootloader.";


// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------
"Chameleon_title" = "Chameleon";
"Chameleon_description" = "Elementi base per l'installazione di Chameleon
boot0 (Sul disco MBR) responsabile del caricamento del boot1.
boot1 (Settore di avvio della partizione) per trovare il boot2.
boot2 (Nella cartella principale della partizione) per caricare il kernel etc.";

"Standard_title" = "Chameleon Standard";
"Standard_description" = "Installare Chameleon";

"EFI_title" = "Partizione EFI";
"EFI_description" = "Installa Chameleon nella partizione EFI (Normalmente nascosta), usando boot0 o boot0md dipende dal vostro sistema e senza compromettere pre-esistenti installazioni di Windows(Se voi ne possedete una).";

"noboot_title" = "Non installare il Bootloader";
"noboot_description" = "Utile se vuoi solo installare i componenti aggiuntivi";


// ============================================================================
// Moduli
// ----------------------------------------------------------------------------
"Module_title" = "Moduli per Chameleon";
"Module_description" = "Il sistema di moduli integrati in chameleon permette ad un utente o programmatore di estendere le funzionalitá di base di chameleon senza bisogno di sostituire il file principale di avvio. ";

"klibc_title" = "klibc";
"klibc_description" = "Questo modulo fornisce una libreria c standard ai moduli per collegarli alla libreria fornita da chameleon nel caso essa non sia sufficiente.
Questo è attualmente usato solo dalla libreria uClibc++.
Fonte: http://www.kernel.org/pub/linux/libs/klibc/";

"AutoReso_title" = "Resolution";
"AutoReso_description" = "Questo modulo legge le informazioni EDID dal monitor collegato al display principale.
Il modulo non è attualmente integrato nel bootloader ed ha un utilizzo minimo dello stesso.
Inoltre, il modulo modificherá la modalitá vesa disponibile nelle schede grafice (pre) Intel HD per fornire una corretta risoluzione durante l'avvio.";

"uClibc_title" = "uClibc++";
"uClibc_description" = "Questo modulo fornisce una minima libreria C++ per l'uso in altri moduli.
Esso non fornisce la funzionalitá di per sè, ma viene utilizzato per consentire l'uso del linguaggio C++ in altri moduli.
Da notare che rtti e exceptions sono entrambe disattivate.
Fonte: http://cxx.uclibc.org/
Dipendenze: klibc";

"Keylayout_title" = "Mappatura tastiera";
"Keylayout_description" = "Questo modulo permette all'utente di definire la mappatura della propria tastiera.";


// ============================================================================
// Utilitá
// Non sono attualmente utilizzate!!!
// ----------------------------------------------------------------------------
"Utility_title" = "Utilitá";
"Utility_description" = "Utilitá  per Chameleon";

"PrefPanel_title" = "Pannello Preferenze";
"PrefPanel_description" = "Installa il Pannello preferenze di Chameleon.";

"SMBIOS_title" = "SMBIOS.plist";
"SMBIOS_description" = "Copia o sovrascrive il file smbios.plist in /Extra/Configuration con uno di esempio";

"Documentation_title" = "Documentazione";
"Documentation_description" = "Documenti per l'installazione e l'uso di Chameleon";


// ============================================================================
// Boot Options - The follow options are split to match the layout OptionalSettings text files.
// but they can be changed to suit however anyone wants to do it.
// ----------------------------------------------------------------------------

"Options_title" = "Opzioni di avvio";
"Options_description" = "Imposta opzioni predefinite di avvio";

"BootBanner_title" = "BootBanner=No";
"BootBanner_description" = "Nasconde il banner di chameleon la boot in modalità grafica";

"GUI_title" = "GUI=No";
"GUI_description" = "Disabilita l'interfaccia grafica, aggiunge GUI=n al com.apple.Boot.plist";

"LegacyLogo_title" = "LegacyLogo=Yes";
"LegacyLogo_description" = "Utilizza mela aple originale (nera) al caricamento";

"InstantMenu_title" = "InstantMenu=Yes";
"InstantMenu_description" = "Carica subito il menu di selezione dei dischi";

"QuietBoot_title" = "QuietBoot=Yes";
"QuietBoot_description" = "Carica immediatamente il disco predefinito";

"ShowInfo_title" = "ShowInfo=Yes";
"ShowInfo_description" = "Abilita le informazioni all'avvio di partizioni e risoluzioni.";

"Wait_title" = "Wait=Yes";
"Wait_description" = "Attende la pressione di un tasto prima di caricare il kernel";

// ----------------------------------------------------------------------------

"arch_title" = "Architettura (arch=i386)";
"arch_description" = "Avvia il kernel in modalità 32bit (consigliato per sistemi con meno di 10GB di RAM)";

"EHCIacquire_title" = "EHCIacquire=Yes";
"EHCIacquire_description" = "Aggiunge EHCIacquire=y al org.chameleon.Boot.plist, Questa opzione sistema eventuali proprietà legati all'EHCI in alcuni BIOS.";

"EthernetBuiltIn_title" = "EthernetBuiltIn=Yes";
"EthernetBuiltIn_description" = "Aggiunge EthernetBuiltIn=y al org.chameleon.Boot.plist, Questa opzione aggiungerà 'built-in' alle periferice di rete.";

"ForceHPET_title" = "ForceHPET=Yes";
"ForceHPET_description" = "Aggiunge ForceHPET=y al org.chameleon.Boot.plist, Questa opzione abilita l'HPET sui chipset Intel, per BIOS che non includono questa opzione.";

"ForceWake_title" = "ForceWake=Yes";
"ForceWake_description" = "Aggiunge ForceWake=y al org.chameleon.Boot.plist, Questa opzione abilita la possibilità di evitare errate sleep images.";

"RestartFix_title" = "RestartFix=No";
"RestartFix_description" = "Disabilita la correzione automatica per il riavvio";

"UHCIreset_title" = "UHCIreset=Yes";
"UHCIreset_description" = "Aggiunge UHCIreset=y al org.chameleon.Boot.plist, Questa opzione resetterà i controller UHCI prima dell'avvio di OS X.";

"UseMemDetect_title" = "UseMemDetect=No";
"UseMemDetect_description" = "Disattiva il riconoscimento della RAM automatico.";

"UseKernelCache_title" = "UseKernelCache=Yes";
"UseKernelCache_description" = "Caricherà il pre-linked kernel e ignorerà Extensions.mkext per /Extra/Extensions e /System/Library/Extensions Di default è No. Da utilizzare (Yes) se utilizzi Lion su partizione Raid.";

"Wake_title" = "Wake=Yes";
"Wake_description" = "Carica dall'immagine dell'ibernazione";

// ----------------------------------------------------------------------------

"CSTUsingSystemIO_title" = "CSTUsingSystemIO=Yes";
"CSTUsingSystemIO_description" = "Nuovo generatore di C-State, usa il registro SystemIO invece del FixedHW.";

"DropSSDT_title" = "DropSSDT=Yes";
"DropSSDT_description" = "Non carica le tabelle SSDT dal BIOS.";

"EnableC2State_title" = "EnableC2State=Yes";
"EnableC2State_description" = "Abilita i C2State";

"EnableC3State_title" = "EnableC3State=Yes";
"EnableC3State_description" = "Abilita i C3State";

"EnableC4State_title" = "EnableC4State=Yes";
"EnableC4State_description" = "Abilita i C4State";

"GenerateCStates_title" = "Genera C-States=Yes";
"GenerateCStates_description" = "Attiva C-State automatici";

"GeneratePStates_title" = "Genera P-States=Yes";
"GeneratePStates_description" = "Attiva P-State automatici";

// ----------------------------------------------------------------------------

"1024x600x32_title" = "1024x600x32";
"1024x600x32_description" = "Setta il Graphics Mode a 1024x600x32";

"1024x768x32_title" = "1024x768x32";
"1024x768x32_description" = "Setta il Graphics Mode a 1024x768x32";

"1280x768x32_title" = "1280x768x32";
"1280x768x32_description" = "Setta il Graphics Mode a 1280x768x32";

"1280x800x32_title" = "1280x800x32";
"1280x800x32_description" = "Setta il Graphics Mode a 1280x800x32";

"1280x1024x32_title" = "1280x1024x32";
"1280x1024x32_description" = "Setta il Graphics Mode a 1280x1024x32";

"1280x960x32_title" = "1280x960x32";
"1280x960x32_description" = "Setta il Graphics Mode a 1280x960x32";

"1440x900x32_title" = "1440x900x32";
"1440x900x32_description" = "Setta il Graphics Mode a 1440x900x32";

"1600x900x32_title" = "1600x900x32";
"1600x900x32_description" = "Setta il Graphics Mode a 1600x900x32";

"1680x1050x32_title" = "1680x1050x32";
"1680x1050x32_description" = "Setta il Graphics Mode a 1680x1050x32";

"1920x1080x32_title" = "1920x1080x32";
"1920x1080x32_description" = "Setta il Graphics Mode a 1920x1080x32";

"1920x1200x32_title" = "1920x1200x32";
"1920x1200x32_description" = "Setta il Graphics Mode a 1920x1200x32";

// ----------------------------------------------------------------------------

"GraphicsEnabler_title" = "GraphicsEnabler=Yes";
"GraphicsEnabler_description" = "Aggiunge GraphicsEnabler=y al org.chameleon.Boot.plist, Questa opzione abilita il riconoscimento automatico delle schede grafiche iniettanto le informazioni corrette.";

"UseAtiROM_title" = "UseAtiROM=Yes";
"UseAtiROM_description" = "Attiva opzione UseAtiROM";

"UseNvidiaROM_title" = "UseNvidiaROM=Yes";
"UseNvidiaROM_description" = "Attiva opzione UseNvidiaROM";

"VBIOS_title" = "VBIOS=Yes";
"VBIOS_description" = "Attiva opzione VBIOS";

// ----------------------------------------------------------------------------
// Boot options - KERNEL FLAGS
// ----------------------------------------------------------------------------

"Verbose_title" = "Modalità Verbose";
"Verbose_description" = "Attiva il registro dettagliato e permette di vedere i menssaggi sia di Chameleon che del Kernel, durante l'avvio. Essenziale per la soluzione di problemi.";

"Singleusermode_title" = "Modalitá Single User";
"Singleusermode_description" = "È una opzione utilizzata per risolvere problemi utilizzata per avviare in command-line BSD/Unix di OS X.";

"Ignorecaches_title" = "Ignora Caches (-f)";
"Ignorecaches_description" = "Non è una opzione necessaria per avviare, ma può essere utile se si desidera che  OS X carichi tutti i file della cartella di sistema, al posto di andare in conflitto con la cache precostruita.";

"Npci_title" = "npci=0x2000";
"Npci_description" = "Imposta la flag npci=0x2000 per la key Kernel Flags";

"Npci3_title" = "npci=0x3000";
"Npci3_description" = "Imposta la flag npci=0x3000 per la key Kernel Flags";

"Darkwake_title" = "darkwake=0";
"Darkwake_description" = "Solo per Lion. Disabilita il 'low power wake' che a volte lascia lo schermo nero dopo il risveglio dallo Sleep/Stop.";


// ----------------------------------------------------------------------------
// Boot options - KEYMAPS
// ----------------------------------------------------------------------------

"mac-de_title" = "Mappatura tastiera Tedesca Mac";
"mac-de_description" = "Usa la mappatura della tastiera Tedesca per Mac";

"mac-es_title" = "Mappatura tastiera Spagnola Mac";
"mac-es_description" = "Usa la mappatura della tastiera Spagnola per Mac";

"mac-fr_title" = "Mappatura tastiera Francese Mac";
"mac-fr_description" = "Usa la mappatura della tastiera Francese per Mac";

"mac-it_title" = "Mappatura tastiera Italiana Mac";
"mac-it_description" = "Usa la mappatura della tastiera Italiana per Mac";

"mac-se_title" = "Mappatura tastiera Svedese Mac";
"mac-se_description" = "Usa la mappatura della tastiera Svedese per Mac";

"mac-pt_title" = "Mappatura tastiera Portoghese Mac";
"mac-pt_description" = "Usa la mappatura della tastiera Portoghese per Mac";

"pc-de_title" = "Mappatura tastiera Tedesca PC";
"pc-de_description" = "Usa la mappatura della tastiera Tedesca per PC";

"pc-es_title" = "Mappatura tastiera Spagnola PC";
"pc-es_description" = "Usa la mappatura della tastiera Spagnola per PC";

"pc-fr_title" = "Mappatura tastiera Francese PC";
"pc-fr_description" = "Usa la mappatura della tastiera Francese per PC";

"pc-it_title" = "Mappatura tastiera Italiana PC";
"pc-it_description" = "Usa la mappatura della tastiera Italiana per PC";

"pc-se_title" = "Mappatura tastiera Svedese PC";
"pc-se_description" = "Usa la mappatura della tastiera Svedese per PC";

"pc-pt_title" = "Mappatura tastiera Portoghese PC";
"pc-pt_description" = "Usa la mappatura della tastiera Portoghese per PC";

// ----------------------------------------------------------------------------
// Boot options - THEMES
// ----------------------------------------------------------------------------

"Embed_title" = "Embed";
"Embed_description" = "Tema integrato in chameleon (Standard ridotto)";

"Legacy_title" = "Legacy";
"Legacy_description" = "Il vecchio tema Standard di chameleon";

"Default_title" = "Standard";
"Default_description" = "Il tema standard usato dal bootloader, aggiunto qui per essere personalizzato.";

"Bullet_title" = "Bullet";
"Bullet_description" = "Un tema The Bullet by NoSmokingBandit";


// ============================================================================
// The filenames from OptionalSettings text files' become sub menu headings.
// These sub menu headings need titles and descriptions.
// ----------------------------------------------------------------------------
// Control

"Control_title" = "Opzioni di Controllo";
"Control_description" = "Settaggi per controllare come Chameleon lavora.";

// General
"General_title" = "Opzioni Generali";
"General_description" = "Seleziona una opzione base.";

// KernelFlags
"KernelFlags_title" = "Flags del Kernel";
"KernelFlags_description" = "Scegli le possibili flag del kernel.";

// PowerManagement
"PowerManagement_title" = "Gestione Energetica";
"PowerManagement_description" = "Selezione di opzioni pre la gestione energetica e speedstep.";

// Resolution
"Resolution_title" = "Risoluzioni";
"Resolution_description" = "Imposta la risoluzione del tuo monitor.";

// Video
"Video_title" = "Video";
"Video_description" = "Selezione di opzioni per il video.";

// Keymaps
"Keymaps_title" = "Mappatura tastiera";
"Keymaps_description" = "Seleziona la mappatura da utilizzare, Verrá anche installato il modulo Keylayout e le mappature tastiera.";

// Themes
"Themes_title" = "Temi";
"Themes_description" = "Una raccolta di temi campione.
Molti altri sono reperibili su http://forum.voodooprojects.org/index.php/board,7.0.html";


// ============================================================================
// Exclusive boot options string - These are added automatically by buildpkg
// Name to be used should be ChooseNone-xxxxxx
// Where xxxxx = the name of the BootOptions file (minus the .txt)
// ----------------------------------------------------------------------------
"ChooseNone-Resolution_title" = "Nessuna";
"ChooseNone-Resolution_description" = "Non utilizzare nessuna risoluzione.";

"ChooseNone-keylayout_title" = "Nessuna";
"ChooseNone-keylayout_description" = "Non scegliere nessuna mappatura tastiera.";
